In [1]:
import pandas as pd
df1 = pd.read_csv('Auto.csv')
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [2]:
# Horse power has wrong data type 
# there are missing values / blanks in mpg, cylinders, displacement

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     394 non-null    float64
 2   displacement  392 non-null    float64
 3   Horse Power   397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

In [4]:
df1.describe() # will execute only on int/float columns

,mpg,cylinders,displacement,weight,acceleration,year,origin
count,392.000000,394.000000,392.000000,397.000000,397.000000,397.000000,397.000000
mean,23.611735,5.439086,191.080357,2970.261965,15.555668,75.994962,1.574307
std,7.827466,1.693452,102.452019,847.904119,2.749995,3.690005,0.802549
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,100.750000,2223.000000,13.800000,73.000000,1.000000
50%,23.000000,4.000000,145.500000,2800.000000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,260.000000,3609.000000,17.100000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [ ]:
# how to extract individual column from data frame
# subset --> []

In [6]:
df1['mpg']

0      18.0
1      15.0
2       NaN
3       NaN
4       NaN
       ...
392    27.0
393    44.0
394    32.0
395    28.0
396    31.0
Name: mpg, Length: 397, dtype: float64

In [7]:
# if you want to extract more than one column --> use second bracket
df1[['mpg','cylinders','acceleration']]

      mpg  cylinders  acceleration
0    18.0        8.0          12.0
1    15.0        8.0          11.5
2     NaN        8.0          11.0
3     NaN        8.0          12.0
4     NaN        8.0          10.5
..    ...        ...           ...
392  27.0        4.0          15.6
393  44.0        4.0          24.6
394  32.0        4.0          11.6
395  28.0        4.0          18.6
396  31.0        4.0          19.4

[397 rows x 3 columns]

In [ ]:
# Keep auto.csv in the above folder
# df1 = pd.read_csv(r'/Users/trainer/Downloads/Auto.csv') # r - read/raw strings

In [9]:
df1['mpg'].mean()

23.611734693877548

In [10]:
df1[['mpg','cylinders','acceleration']].min()

mpg             9.0
cylinders       3.0
acceleration    8.0
dtype: float64

In [15]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [19]:
df1['col1'] = df1['acceleration'] + df1['origin'] # +, -, *, /, //, %, ** 
# here we are asking python to add values from accleration to origin and store the output in 'col1' (random name given)

In [24]:
df1.head() # preview the dataset to see the changes

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,12.0
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,13.0
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,11.5

In [26]:
df1['col2'] = df1['acceleration']**2 # if new name was given --> it will create the column
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0,144.00
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5,132.25
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,12.0,121.00
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,13.0,144.00
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,11.5,110.25

In [27]:
df1['col2'] = df1['acceleration'] +20 # in brackets if old name was given data will be replaced
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0,32.0
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5,31.5
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,12.0,31.0
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,13.0,32.0
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,11.5,30.5

#### Data Cleaning

In [28]:
# astype: int <--> float/ any data type to string 
# pd.to_numeric : object --> int 

df1.head(2) # preview of dataset

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0,32.0
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5,31.5

In [33]:
df1['col3'] = df1['acceleration'].astype(int) # if accleration was given in brackets --> data wil be replaced

In [38]:
df1['Horse Power'].astype(int)

ValueError: invalid literal for int() with base 10: '?'

In [35]:
int('20') # valid conversion

20

In [36]:
int('a')

ValueError: invalid literal for int() with base 10: 'a'

In [47]:
import numpy as np
np.array([1,2,3,4,5,'?'])

array(['1', '2', '3', '4', '5', '?'], dtype='<U21')

In [48]:
numpy.array([1,2,3,4,5,np.nan])

array([ 1.,  2.,  3.,  4.,  5., nan])

In [42]:
df1.isna().sum()

mpg             5
cylinders       3
displacement    5
Horse Power     0
weight          0
acceleration    0
year            0
origin          0
name            0
col1            0
col2            0
col3            0
dtype: int64

In [44]:
df1['Horse Power'] = pd.to_numeric(df1['Horse Power'], errors = 'coerce') 
# errors = coerce --> when encounterd error skip them by converting them into blanks
# ? --> null / blanks/empty

In [45]:
df1.isna().sum() # after conversion 5 '?' replaced with Null

mpg             5
cylinders       3
displacement    5
Horse Power     5
weight          0
acceleration    0
year            0
origin          0
name            0
col1            0
col2            0
col3            0
dtype: int64

In [49]:
#### handling Null values

In [ ]:
# 1. Drop the rows where i have blanks
# 2. Replace null values with mean/median/mode --> statistical values

In [50]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,13.0,32.0,12
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,12.5,31.5,11
2,NaN,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,12.0,31.0,11
3,NaN,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,13.0,32.0,12
4,NaN,8.0,NaN,140.0,3449,10.5,70,1,ford torino,11.5,30.5,10
5,NaN,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,11.0,30.0,10
6,NaN,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,10.0,29.0,9
7,14.0,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,9.5,28.5,8
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,11.0,30.0,10
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,9.5,28.5,8

In [51]:
df1.dropna() # changes are not saved in df1

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,13.0,32.0,12
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,12.5,31.5,11
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,11.0,30.0,10
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,9.5,28.5,8
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,11.0,30.0,10
...,...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790,15.6,82,1,ford mustang gl,16.6,35.6,15
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,26.6,44.6,24
394,32.0,4.0,135.0,84.0,2295,11.6,82,1,dodge rampage,12.6,31.6,11
395,28.0,4.0,120.0,79.0,2625,18.6,82,1,ford ranger,19.6,38.6,18
396,31.0,4.0,119.0,82.0,2720,19.4,82,1,chevy s-10,20.4,39.4,19

In [52]:
383/397

0.964735516372796

In [53]:
df1.shape

(397, 12)

In [ ]:
# df1 = df1.dropna()
# or
# df1.dropna(inplace = True) # making the changes permanent

In [54]:
df1['mpg'].mean()

23.611734693877548

In [55]:
df1['mpg'] = df1['mpg'].fillna(23.611734693877548)

In [56]:
df1.isna().sum()

mpg             0
cylinders       3
displacement    5
Horse Power     5
weight          0
acceleration    0
year            0
origin          0
name            0
col1            0
col2            0
col3            0
dtype: int64

In [ ]:
# df1['mpg'] = df1['mpg'].fillna(df1['mpg'].mean())

In [57]:
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,13.0,32.0,12
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,12.5,31.5,11
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,12.0,31.0,11
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,13.0,32.0,12
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,11.5,30.5,10

In [ ]:
# Drop unnecessary columns

In [58]:
df1.drop(columns= ['col1','col2'],inplace = True)

In [59]:
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col3
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,12
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,11
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,11
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,12
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,10

In [60]:
df1.drop('col3',axis = 1,inplace = True) # axis = 1 --> for columns # drop/delete col3 from df1
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320

In [61]:
#### Renaming columns
df1.rename({'Horse Power': 'horse_power'},axis = 1, inplace = True)
df1.head(2)

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320

#### Data Manipulation

In [62]:
# taking subset in data frame

In [63]:
df1.head(10)

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino
5,23.611735,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500
6,23.611735,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala
7,14.000000,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii
8,14.000000,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina
9,15.000000,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl

In [64]:
df1.iloc[1:9,3:6]

   horse_power  weight  acceleration
1        165.0    3693          11.5
2        150.0    3436          11.0
3        150.0    3433          12.0
4        140.0    3449          10.5
5        198.0    4341          10.0
6        220.0    4354           9.0
7        215.0    4312           8.5
8        225.0    4425          10.0

In [65]:
## loc

In [ ]:
# we need to give names instead of index numbers
# End value is included

In [66]:
df1.loc[1:8, 'horse_power':'acceleration']

   horse_power  weight  acceleration
1        165.0    3693          11.5
2        150.0    3436          11.0
3        150.0    3433          12.0
4        140.0    3449          10.5
5        198.0    4341          10.0
6        220.0    4354           9.0
7        215.0    4312           8.5
8        225.0    4425          10.0

In [ ]:
### applying a function

In [68]:
def sqr_num(num):
    return num**2

In [69]:
df1['acceleration'].apply(sqr_num)

0      144.00
1      132.25
2      121.00
3      144.00
4      110.25
        ...
392    243.36
393    605.16
394    134.56
395    345.96
396    376.36
Name: acceleration, Length: 397, dtype: float64

In [70]:
def evn_odd(num):
    if num%2 ==0:
        return 'Even'
    else:
        return 'Odd'

In [73]:
df1['col1'] =  df1['acceleration'].apply(evn_odd)
df1.head(2)

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,Even
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,Odd

In [74]:
df1['col2'] =  df1['acceleration'].apply(lambda num: num**2)
df1['col3'] =  df1['acceleration'].apply(lambda num: 'Even' if num%2 ==0 else 'Odd')
df1.head()

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,Even,144.00,Even
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,Odd,132.25,Odd
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,Odd,121.00,Odd
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,Even,144.00,Even
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,Odd,110.25,Odd

In [76]:
df1.sort_values(by ='mpg', ascending = False)
# ascending = True --> for ascending order

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name,col1,col2,col3
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,Odd,320.41,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,Odd,190.44,Odd
325,44.3,4.0,90.0,48.0,2085,21.7,80,2,vw rabbit c (diesel),Odd,470.89,Odd
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,Odd,605.16,Odd
326,43.4,4.0,90.0,48.0,2335,23.7,80,2,vw dasher (diesel),Odd,561.69,Odd
...,...,...,...,...,...,...,...,...,...,...,...,...
67,11.0,8.0,429.0,208.0,4633,11.0,72,1,mercury marquis,Odd,121.00,Odd
27,11.0,8.0,318.0,210.0,4382,13.5,70,1,dodge d200,Odd,182.25,Odd
26,10.0,8.0,307.0,200.0,4376,15.0,70,1,chevy c20,Odd,225.00,Odd
25,10.0,8.0,360.0,215.0,4615,14.0,70,1,ford f250,Even,196.00,Even
28,9.0,8.0,304.0,193.0,4732,18.5,70,1,hi 1200d,Odd,342.25,Odd

In [77]:
# conditional formating

In [78]:
# extract records where mpg value is greater than 40

In [80]:
cond1 = df1['mpg'] > 40 # Relational operators ouput will always be boolean # <,>, <=, >= , ==, !=
cond1

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393     True
394    False
395    False
396    False
Name: mpg, Length: 397, dtype: bool

In [81]:
df1[cond1]

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name,col1,col2,col3
244,43.1,4.0,90.0,48.0,1985,21.5,78,2,volkswagen rabbit custom diesel,Odd,462.25,Odd
309,41.5,4.0,98.0,76.0,2144,14.7,80,2,vw rabbit,Odd,216.09,Odd
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,Odd,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,Odd,368.64,Odd
325,44.3,4.0,90.0,48.0,2085,21.7,80,2,vw rabbit c (diesel),Odd,470.89,Odd
326,43.4,4.0,90.0,48.0,2335,23.7,80,2,vw dasher (diesel),Odd,561.69,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,Odd,190.44,Odd
330,40.9,4.0,85.0,NaN,1835,17.3,80,2,renault lecar deluxe,Odd,299.29,Odd
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,Odd,605.16,Odd

In [82]:
cond2 = (df1['mpg'] > 40) & (df1['origin'] == 3)
cond2

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393    False
394    False
395    False
396    False
Length: 397, dtype: bool

In [83]:
df1[cond2]

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name,col1,col2,col3
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,Odd,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,Odd,368.64,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,Odd,190.44,Odd

In [85]:
df1[(df1['mpg'] > 40) & (df1['origin'] == 3)] # reality

,mpg,cylinders,displacement,horse_power,weight,acceleration,year,origin,name,col1,col2,col3
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,Odd,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,Odd,368.64,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,Odd,190.44,Odd